Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Enums/ПС_АлгоритмыПолученияДопИнформации/ПС_АлгоритмыПолученияДопИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПС_АлгоритмыПолученияДопИнформации</name>
  <enumValues>
    <name>ОбычныйРеквизит</name>
  </enumValues>
  <enumValues>
    <name>ДопРеквизитБСП</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйКод</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
</mdclass:Enum>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Catalogs/ПС_НастройкиКонкурентногоАнализа/ПС_НастройкиКонкурентногоАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_НастройкиКонкурентногоАнализа</name>
  <predefined>
    <items>
      <name>СайтыКонкурентов</name>
      <description>Сайты конкурентов</description>
    </items>
    <items>
      <name>ДопИдентификаторыНоменклатуры</name>
      <description>Доп идентификаторы номенклатуры</description>
    </items>
  </predefined>
  <tabularSections>
    <name>СписокНастроек</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмПолучения</name>
      <type>
        <types>EnumRef.ПС_АлгоритмыПолученияДопИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/CommonModules/ПС_ПолучениеДанныхВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ДополнитьИдентификаторыПоНоменклатуре(СсылкаНаНоменклатуру, ДополнительныеИдентификаторы) Экспорт
	
	ЗапросДопИнформации = Новый Запрос;
	ЗапросДопИнформации.Текст = 
	"ВЫБРАТЬ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Наименование КАК Наименование,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Значение КАК Значение,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.АлгоритмПолучения КАК АлгоритмПолучения
	|ИЗ
	|	Справочник.ПС_НастройкиКонкурентногоАнализа.СписокНастроек КАК ПС_НастройкиКонкурентногоАнализаСписокНастроек
	|ГДЕ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Ссылка = &Ссылка";
	
	ЗапросДопИнформации.УстановитьПараметр("Ссылка", Справочники.ПС_НастройкиКонкурентногоАнализа.ДопИдентификаторыНоменклатуры);
	
	ВыборкаДопИнформации = ЗапросДопИнформации.Выполнить().Выбрать();
	
	Пока ВыборкаДопИнформации.Следующий() Цикл
		
		Если ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ОбычныйРеквизит Тогда
			
			Попытка
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаНоменклатуру, ВыборкаДопИнформации.Значение));
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);					
						
			Исключение
						
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Не удалось получить реквизит по номенклатуре: " + СсылкаНаНоменклатуру + " по причине: " + ОписаниеОшибки();
				СообщениеПользователю.Сообщить();						
										
			КонецПопытки;
			
		ИначеЕсли ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ДопРеквизитБСП Тогда
			
			Попытка
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, УправлениеСвойствами.ЗначениеСвойства(СсылкаНаНоменклатуру, ВыборкаДопИнформации.Значение));
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);					
						
			Исключение
						
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Не удалось получить доп. реквизит БСП по номенклатуре: " + СсылкаНаНоменклатуру + " по причине: " + ОписаниеОшибки();
				СообщениеПользователю.Сообщить();						
										
			КонецПопытки; 
			
		ИначеЕсли ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ФиксированноеЗначение Тогда
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, ВыборкаДопИнформации.Значение);
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);	
				
		ИначеЕсли ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ПроизвольныйКод Тогда
			
			Попытка
				
				Значение = Неопределено;
				
				УстановитьБезопасныйРежим(Истина);
				Выполнить(ВыборкаДопИнформации.Значение);
				УстановитьБезопасныйРежим(Ложь);
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, Значение);
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);					
						
			Исключение
						
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Не удалось выполнить произвольный код по номенклатуры: " + СсылкаНаНоменклатуру + " по причине: " + ОписаниеОшибки();
				СообщениеПользователю.Сообщить();						
										
			КонецПопытки; 								
							
		КонецЕсли;
		
	КонецЦикла;
	
	//В разных конфигурациях данные могут храниться в доп. регистрах, доп. реквизитах и т.д.
	
	МодульПолученияДопДанных = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульПолученияДопДанных = Вычислить("ПС_ПолучениеДанныхУправлениеТорговлей");
		УстановитьБезопасныйРежим(Ложь);
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульПолученияДопДанных = Вычислить("ПС_ПолучениеДанныхБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульПолученияДопДанных <> Неопределено Тогда
		
		МодульПолученияДопДанных.ПолучитьДопИдентификаторыПоНоменклатуре(СсылкаНаНоменклатуру, ДополнительныеИдентификаторы);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

Функция СписокСайтовДляКонкурентногоАнализа() Экспорт
	
	ЗапросДопИнформации = Новый Запрос;
	ЗапросДопИнформации.Текст = 
	"ВЫБРАТЬ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Наименование КАК Наименование,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Значение КАК Значение,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.АлгоритмПолучения КАК АлгоритмПолучения
	|ИЗ
	|	Справочник.ПС_НастройкиКонкурентногоАнализа.СписокНастроек КАК ПС_НастройкиКонкурентногоАнализаСписокНастроек
	|ГДЕ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Ссылка = &Ссылка";
	
	ЗапросДопИнформации.УстановитьПараметр("Ссылка", Справочники.ПС_НастройкиКонкурентногоАнализа.СайтыКонкурентов);
	
	ВыборкаДопИнформации = ЗапросДопИнформации.Выполнить().Выбрать();
	
	СайтыКонкурентов = Новый Массив;	
	
	Пока ВыборкаДопИнформации.Следующий() Цикл
			
		//TODO: Предусмотреть динамическое получение по произвольному алгоритму или из доп. реквизита какой-то ссылки, например, номенклатуры			
		СтруктураДопИнформации = Новый Соответствие;
		СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, ВыборкаДопИнформации.Значение);	
		СайтыКонкурентов.Добавить(СтруктураДопИнформации);			
				
	КонецЦикла;
	
	Возврат СайтыКонкурентов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
